<template>
  <view class="app">
    <view class="item" v-for="(item,index) in info" :key="index" @click="toPage(item)">
      <view class="image">
        <image :src="item.i"/>
      </view>
      <view class="info">
        <text>{{ item.msg }}</text>
      </view>
    </view>
  </view>
</template>

<script setup>
import test from '@/static/image/test.png'
import {ref} from 'vue'

const info = ref([
  {
    i: test,
    msg: '三亚景点的旅游元素大致分为玩海，雨林，人文和打卡景点。\n' +
        '              玩海可以去四大海湾（三亚湾、大东海、亚龙湾和海棠湾\n' +
        '              ），还可以去三大海岛（蜈支洲岛、分界洲岛、西岛），更可以跟随户外俱乐部去那些人少景美还有漂亮海底风景的私人岛屿野营、浮潜（比如加井岛）。\n' +
        '              热带雨林也主要有三个，鸟巢背山面海得天独厚景观一流；槟榔谷自然人文相得益彰让人难忘；而呀诺达则以壮阔的山景取胜，但也略显单调。\n' +
        '              人文景点有三亚千古情、南山和大小洞天，这东西见仁见智，推荐度不高。\n' +
        '              而打卡景点是天涯海角和鹿回头，天涯海角更胜在有强大的象征意义，而鹿回头的夕阳和夜景倒是相当值得一看。'
  },
  {
    i: test,
    msg: '三亚景点的旅游元素大致分为玩海，雨林，人文和打卡景点。\n' +
        '              玩海可以去四大海湾（三亚湾、大东海、亚龙湾和海棠湾\n' +
        '              ），还可以去三大海岛（蜈支洲岛、分界洲岛、西岛），更可以跟随户外俱乐部去那些人少景美还有漂亮海底风景的私人岛屿野营、浮潜（比如加井岛）。\n' +
        '              热带雨林也主要有三个，鸟巢背山面海得天独厚景观一流；槟榔谷自然人文相得益彰让人难忘；而呀诺达则以壮阔的山景取胜，但也略显单调。\n' +
        '              人文景点有三亚千古情、南山和大小洞天，这东西见仁见智，推荐度不高。\n' +
        '              而打卡景点是天涯海角和鹿回头，天涯海角更胜在有强大的象征意义，而鹿回头的夕阳和夜景倒是相当值得一看。'
  },
  {
    i: test,
    msg: '三亚景点的旅游元素大致分为玩海，雨林，人文和打卡景点。\n' +
        '              玩海可以去四大海湾（三亚湾、大东海、亚龙湾和海棠湾\n' +
        '              ），还可以去三大海岛（蜈支洲岛、分界洲岛、西岛），更可以跟随户外俱乐部去那些人少景美还有漂亮海底风景的私人岛屿野营、浮潜（比如加井岛）。\n' +
        '              热带雨林也主要有三个，鸟巢背山面海得天独厚景观一流；槟榔谷自然人文相得益彰让人难忘；而呀诺达则以壮阔的山景取胜，但也略显单调。\n' +
        '              人文景点有三亚千古情、南山和大小洞天，这东西见仁见智，推荐度不高。\n' +
        '              而打卡景点是天涯海角和鹿回头，天涯海角更胜在有强大的象征意义，而鹿回头的夕阳和夜景倒是相当值得一看。'
  },
  {
    i: test,
    msg: '三亚景点的旅游元素大致分为玩海，雨林，人文和打卡景点。\n' +
        '              玩海可以去四大海湾（三亚湾、大东海、亚龙湾和海棠湾\n' +
        '              ），还可以去三大海岛（蜈支洲岛、分界洲岛、西岛），更可以跟随户外俱乐部去那些人少景美还有漂亮海底风景的私人岛屿野营、浮潜（比如加井岛）。\n' +
        '              热带雨林也主要有三个，鸟巢背山面海得天独厚景观一流；槟榔谷自然人文相得益彰让人难忘；而呀诺达则以壮阔的山景取胜，但也略显单调。\n' +
        '              人文景点有三亚千古情、南山和大小洞天，这东西见仁见智，推荐度不高。\n' +
        '              而打卡景点是天涯海角和鹿回头，天涯海角更胜在有强大的象征意义，而鹿回头的夕阳和夜景倒是相当值得一看。'
  }, {
    i: test,
    msg: '三亚景点的旅游元素大致分为玩海，雨林，人文和打卡景点。\n' +
        '              玩海可以去四大海湾（三亚湾、大东海、亚龙湾和海棠湾\n' +
        '              ），还可以去三大海岛（蜈支洲岛、分界洲岛、西岛），更可以跟随户外俱乐部去那些人少景美还有漂亮海底风景的私人岛屿野营、浮潜（比如加井岛）。\n' +
        '              热带雨林也主要有三个，鸟巢背山面海得天独厚景观一流；槟榔谷自然人文相得益彰让人难忘；而呀诺达则以壮阔的山景取胜，但也略显单调。\n' +
        '              人文景点有三亚千古情、南山和大小洞天，这东西见仁见智，推荐度不高。\n' +
        '              而打卡景点是天涯海角和鹿回头，天涯海角更胜在有强大的象征意义，而鹿回头的夕阳和夜景倒是相当值得一看。'
  },
  {
    i: test,
    msg: '三亚景点的旅游元素大致分为玩海，雨林，人文和打卡景点。\n' +
        '              玩海可以去四大海湾（三亚湾、大东海、亚龙湾和海棠湾\n' +
        '              ），还可以去三大海岛（蜈支洲岛、分界洲岛、西岛），更可以跟随户外俱乐部去那些人少景美还有漂亮海底风景的私人岛屿野营、浮潜（比如加井岛）。\n' +
        '              热带雨林也主要有三个，鸟巢背山面海得天独厚景观一流；槟榔谷自然人文相得益彰让人难忘；而呀诺达则以壮阔的山景取胜，但也略显单调。\n' +
        '              人文景点有三亚千古情、南山和大小洞天，这东西见仁见智，推荐度不高。\n' +
        '              而打卡景点是天涯海角和鹿回头，天涯海角更胜在有强大的象征意义，而鹿回头的夕阳和夜景倒是相当值得一看。'
  },
  {
    i: test,
    msg: '三亚景点的旅游元素大致分为玩海，雨林，人文和打卡景点。\n' +
        '              玩海可以去四大海湾（三亚湾、大东海、亚龙湾和海棠湾\n' +
        '              ），还可以去三大海岛（蜈支洲岛、分界洲岛、西岛），更可以跟随户外俱乐部去那些人少景美还有漂亮海底风景的私人岛屿野营、浮潜（比如加井岛）。\n' +
        '              热带雨林也主要有三个，鸟巢背山面海得天独厚景观一流；槟榔谷自然人文相得益彰让人难忘；而呀诺达则以壮阔的山景取胜，但也略显单调。\n' +
        '              人文景点有三亚千古情、南山和大小洞天，这东西见仁见智，推荐度不高。\n' +
        '              而打卡景点是天涯海角和鹿回头，天涯海角更胜在有强大的象征意义，而鹿回头的夕阳和夜景倒是相当值得一看。'
  },
  {
    i: test,
    msg: '三亚景点的旅游元素大致分为玩海，雨林，人文和打卡景点。\n' +
        '              玩海可以去四大海湾（三亚湾、大东海、亚龙湾和海棠湾\n' +
        '              ），还可以去三大海岛（蜈支洲岛、分界洲岛、西岛），更可以跟随户外俱乐部去那些人少景美还有漂亮海底风景的私人岛屿野营、浮潜（比如加井岛）。\n' +
        '              热带雨林也主要有三个，鸟巢背山面海得天独厚景观一流；槟榔谷自然人文相得益彰让人难忘；而呀诺达则以壮阔的山景取胜，但也略显单调。\n' +
        '              人文景点有三亚千古情、南山和大小洞天，这东西见仁见智，推荐度不高。\n' +
        '              而打卡景点是天涯海角和鹿回头，天涯海角更胜在有强大的象征意义，而鹿回头的夕阳和夜景倒是相当值得一看。'
  },
  {
    i: test,
    msg: '三亚景点的旅游元素大致分为玩海，雨林，人文和打卡景点。\n' +
        '              玩海可以去四大海湾（三亚湾、大东海、亚龙湾和海棠湾\n' +
        '              ），还可以去三大海岛（蜈支洲岛、分界洲岛、西岛），更可以跟随户外俱乐部去那些人少景美还有漂亮海底风景的私人岛屿野营、浮潜（比如加井岛）。\n' +
        '              热带雨林也主要有三个，鸟巢背山面海得天独厚景观一流；槟榔谷自然人文相得益彰让人难忘；而呀诺达则以壮阔的山景取胜，但也略显单调。\n' +
        '              人文景点有三亚千古情、南山和大小洞天，这东西见仁见智，推荐度不高。\n' +
        '              而打卡景点是天涯海角和鹿回头，天涯海角更胜在有强大的象征意义，而鹿回头的夕阳和夜景倒是相当值得一看。'
  }, {
    i: test,
    msg: '三亚景点的旅游元素大致分为玩海，雨林，人文和打卡景点。\n' +
        '              玩海可以去四大海湾（三亚湾、大东海、亚龙湾和海棠湾\n' +
        '              ），还可以去三大海岛（蜈支洲岛、分界洲岛、西岛），更可以跟随户外俱乐部去那些人少景美还有漂亮海底风景的私人岛屿野营、浮潜（比如加井岛）。\n' +
        '              热带雨林也主要有三个，鸟巢背山面海得天独厚景观一流；槟榔谷自然人文相得益彰让人难忘；而呀诺达则以壮阔的山景取胜，但也略显单调。\n' +
        '              人文景点有三亚千古情、南山和大小洞天，这东西见仁见智，推荐度不高。\n' +
        '              而打卡景点是天涯海角和鹿回头，天涯海角更胜在有强大的象征意义，而鹿回头的夕阳和夜景倒是相当值得一看。'
  }
])

const toPage = (i) => {
  uni.navigateTo({
    url: `/pages/index/info/index?data=${JSON.stringify(i)}`
  })
}
</script>

<style lang="scss" scoped>
.app{
  //border: 1px solid red;
  display: flex;
  box-sizing: border-box;
  width: 100%;
  height: 100vh;
  background: rgb(219, 219, 225);
  flex-wrap: wrap;
  padding: 5px;
  overflow-y: scroll !important;
  justify-content: center;

  .item{
    //border: 1px solid red;
    width: calc(49% - 10px);
    height: 250px;
    margin: 10px 5px;
    background: white;
    border-radius: 5px;

    .image{
      //border: 1px solid red;
      width: 100%;
      height: 85%;
      display: flex;
      justify-content: center;
      align-items: center;
      border-radius: 5px;

      image{
        width: 100%;
        height: 100%;
        border-radius: 5px;
      }
    }

    .info{
      //border: 1px solid red;
      width: 100%;
      height: 15%;
      overflow-y: scroll;
    }
  }
}
</style>